app/views/users/show.html.erb

<h2>Current Loans</h2>
<% @user.loans.where(status: [:requested, :approved, :open]).each do |loan| %>
---
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = ? AND "loans"."status" IN (?, ?, ?)  [["user_id", 1], ["status", 0], ["status", 1], ["status", 2]]

<h2>Previous Loans</h2>
<% @user.loans.where(status: [:closed, :rejected]).each do |loan| %>
---
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = ? AND "loans"."status" IN (?, ?)  [["user_id", 1], ["status", 3], ["status", 4]]