app/controllers/loans_controller.rb

  def create
    @user = User.find(params[:user_id])
    @loan = @user.loans.build(loan_params)
    @loan.admin = Admin.first # Assuming there's only one admin
    if @loan.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "loans".* FROM "loans" WHERE "loans"."user_id" = ?  [["user_id", 1]]
SELECT "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "loans" ("amount", "interest_rate", "status", "user_id", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["amount", 20000.0], ["interest_rate", 5.0], ["status", 0], ["user_id", 1], ["admin_id", 1], ["created_at", "2024-07-16 08:03:41.242740"], ["updated_at", "2024-07-16 08:03:41.242740"]]