app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])
    admin = Admin.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "user1@example.com"], ["LIMIT", 1]]
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "user1@example.com"], ["LIMIT", 1]]